run/tutorial2/fluidBlock/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 3.6;

boundaryField
{
    fluidInlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        mixingLength    2.8e-4;
        value           uniform 3.6;
    }

    fluidOutlet
    {
        type            inletOutlet;
        inletValue      uniform 3.6;
        value           uniform 3.6;
    }

    fluidCoupledWall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 3.6;
    }

    fluidSide
    {
        type            symmetryPlane;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
